# --- Languages ---
brew "node"

# --- Shell ---
brew "zsh-autosuggestions"

# --- Terminal Tools ---
brew "fastfetch"
brew "lazydocker"
brew "lazygit"
brew "ctop"
brew "gh"
brew "fzf"
brew "jq"
brew "bat"
brew "eza"
brew "ripgrep"
brew "fd"
brew "gcalcli"

# --- GUI Apps ---
cask "karabiner-elements"

# --- Font ---
cask "font-jetbrains-mono-nerd-font"
