# --- Dotfiles 管理 ---
brew "stow"

# --- Languages ---
brew "node"
brew "deno" # peek.nvim (Markdown プレビュー) が必要とする

# --- Shell ---
brew "zsh-autosuggestions"

# --- Terminal Tools ---
tap "daipeihust/tap"
brew "daipeihust/tap/im-select" # nvim の挿入モード離脱時に英字入力へ戻す (im-select.nvim が使用)
brew "fastfetch"
brew "lazydocker"
brew "lazygit"
brew "ctop"
brew "gh"
brew "fzf"
brew "jq"
brew "bat"
brew "eza"
brew "ripgrep"
brew "fd"
brew "gcalcli"

# --- Window Manager / Bar ---
tap "nikitabobko/tap"
cask "nikitabobko/tap/aerospace" # ウィンドウマネージャー (.config/aerospace/)

tap "FelixKratz/formulae"
brew "sketchybar" # ステータスバー (.config/sketchybar/)
brew "borders" # JankyBorders、フォーカス中ウィンドウの枠線 (.config/borders/)

# --- GUI Apps ---
cask "karabiner-elements"
cask "wezterm"
cask "ghostty"

# --- Font ---
cask "font-jetbrains-mono-nerd-font"
